import aboutImg from "../img/img1.jpg";

const About = () => {
  return (
    <div className=" border-b border-neutral-900 pb-4">
      <h2 className=" my-20 text-center text-4xl ">
        About <span className="text-neutral-500">Me</span>
      </h2>
      <div className="flex flex-wrap">
        <div className="w-full lg:w-1/2 lg:p-8">
          <div className="flex items-center justify-center">
            <img className=" rounded-2xl" src={aboutImg} alt="about" />
          </div>
        </div>
        <div className="w-full lg:w-1/2">
          <div className=" flex justify-center lg:justify-start">
            <p className="text-xl p-4">
              ผมเป็นคนที่ มองโลกในแง่ดีและมีความรับผิดชอบสูง
              ชอบตั้งเป้าหมายให้ตัวเองเพื่อพัฒนาตัวเองอยู่เสมอ
              นิสัยส่วนตัวของผมคือ เป็นกันเอง ยิ้มง่าย และมักจะ
              ให้ความสำคัญกับการดูแลจิตใจของคนรอบข้าง เวลาว่าง
              ผมชอบทำหลายสิ่งที่ช่วยให้ผ่อนคลายและเติมพลัง เช่น
              อ่านหนังสือแนวพัฒนาตัวเอง หรือ นิยาย บางครั้งก็ชอบออกไป
              เดินเล่นในธรรมชาติ
              เพราะรู้สึกว่ามันช่วยให้หัวโล่งและเพิ่มแรงบันดาลใจ
              นอกจากนี้ผมยังสนใจการ ดูภาพยนตร์และซีรีส์
              โดยเฉพาะแนวที่ท้าทายความคิด
              สิ่งที่ผมภูมิใจในตัวเองคือการเป็นคนที่พร้อมช่วยเหลือคนอื่นเสมอ
              ไม่ว่าจะเป็นเรื่องเล็กน้อยหรือเรื่องใหญ่
              เพราะผมเชื่อว่าการส่งต่อความช่วยเหลือและกำลังใจสามารถสร้างความเปลี่ยนแปลงได้
              สุดท้ายนี้
              ผมมองว่าทุกความสัมพันธ์เป็นโอกาสที่จะได้เรียนรู้สิ่งใหม่ ๆ
              และเติบโตไปด้วยกัน ยินดีที่ได้รู้จักทุกคน
              และหวังว่าจะได้พูดคุยหรือแลกเปลี่ยนกันในโอกาสต่อไปนะครับ
            </p>
          </div>
        </div>
      </div>
    </div>
  );
};

export default About;
